from threading import Timer
import pyautogui
import pywhatkit as w
import csv
import time

csvreader = csv.reader(open('./broadcast.csv'))

header = []
header = next(csvreader)
# print(header)

rows = []

for row in csvreader:
    if len(row[1]) != 0:
        rows.append(row)
        # print(row)

print(rows[0])

for row in rows:
    w.sendwhatmsg_instantly(row[1], "إعلان هام\nالسادة أولياء الأمور و أعضاء فرق مجموعات الكشافة و المرشدات \nيعلن مجلس قيادة المجموعات عن إقامة حفل ترقي و انتقال مجموعات الكشافة و المرشدات \nعلمًا أن الترقى يكون للأفراد الذين اجتازوا متطلبات درجة كشاف/مرشدة تانى و أول \nو كذلك عقد اجتماعات أولياء الأمور وفقًا للجدول التالى يوم الجمعة الموافق 1-4-2022\nالأفراد المنضمين حديثًا (فبراير/مارس 2022)\nميعاد الاجتماع يوم الجمعة القادمة فقط من الساعة 1:30 الي الساعة 3:30 .\nالحضور بتيشرت الكشافة الرصاصي class   B  و بنطلون جينز.\nجتماع   أولياء الأمور من الساعة 2 إلى الساعة 3:30 عصًرا فى قاعة الاجتماعات عند المسجد.\nالأفراد القدماء من 2021 و قبل ذلك\nميعاد الاجتماع يوم الجمعة القادمة فقط من الساعة 1:30 الي الساعة 5:30.\nالحضور بالقميص الكشفي الأبيض class   A  و بنطلون جينز  و حذاء أسود.\nاجتماع  أولياء الأمور من الساعة 5:30 إلى الساعة 6:30 فى قاعة الاجتماعات عند المسجد.\nمع تمنيات مجلس قيادة المجموعات  بدوام التوفيق لجميع منتسبى المجموعات",20)
    pyautogui.click(1050, 950)
    pyautogui.press("enter")
    time.sleep(15)
